#Вычислите 20!. Выведите на экран вычисленное значение.
a=20
import math
print(math.factorial(a))