#Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
import math
a=179**2+971**2
b=math.sqrt(a)
print(b)